{
  "JavaScript for Automation (JXA) support in Nova.": "JavaScript for Automation (JXA)-Unterstützung für Nova.",

  "Use global setting": "Globale Einstellung übernehmen",
  "Disabled": "Aus",
  "On Change": "Bei jeder Änderung",
  "On Save": "Beim Sichern",

  "Linting": "Fehlerprüfung",
  "Whether and when automatic linting of open JXA files should be performed.": "Ob und wann offene JXA-Dateien auf Fehler überprüft werden sollen.",
  "Hide extra linter information.": "Linter-Information ausblenden",
  "Linters will add an informative entry when they find issues. The exact contents of that entry depend on the active linter (ESLint or osacompile). Check this if you only want the reported issues displayed.": "Fehlerprüfungsmodule fügen der Anzeige einen Informationseintrag hinzu, wenn sie Fehler finden. Der genaue Inhalt dieses Eintrags hängt vom Modul (ESLint oder oscacompile) ab. Diese Option unterbindet dessen Anzeige.",
  "eslint binary path": "eslint-Pfad",
  "Path to the eslint binary to use when linting. If this is unset, the extension will look for a project-local instance of the binary first, then for a global one. Only set this if you need to use a binary that will not be found in your $PATH.": "Pfad zum ausführbaren eslint-Skript, das zur Fehlerprüfung verwendet werden soll. Wenn hier nichst eingestellt ist, wird die Erweiterung erst nach einer Projektlokalen ESLint-Installation suchen, dann nach einer globalen. Diese Einstellung wird nur benötigt, wenn eine eslint-Version benutzt werden soll, die nicht im $PATH liegt.",
  "Path to the eslint binary to use when linting. If this is unset, the global setting is used. If that is unset too, the extension will look for a project-local instance of the binary first, then for a global one. Only set this if you need to use a binary that will not be found in your $PATH.": "Pfad zum ausführbaren eslint-Skript, das zur Fehlerprüfung verwendet werden soll. Wenn hier nichts eingestellt ist, gilt die globale Einstellung. Wenn dort auch nichst eingestellt ist, wird die Erweiterung erst nach einer Projektlokalen ESLint-Installation suchen, dann nach einer globalen. Diese Einstellung wird nur benötigt, wenn eine eslint-Version benutzt werden soll, die nicht im $PATH liegt.",
  "Open file in Script Editor…": "Datei im Skript-Editor öffnen …",
  "Send selection to Script Editor…": "Auswahl an Skript-Editor senden …",
  "JXA Workspace preferences…": "JXA-Projekteinstellungen …",

  "Compile JXA Script": "JXA-Skript kompilieren",
  "Compiles the current JavaScript for Automation (JXA) source file to a binary JXA script.": "Kompiliert die aktuelle JXA-Quelltextdatei zu einem binären JXA-Skript.",
  "Build directory": "Build-Ordner",
  "The directory where to put the compiled scripts, relative to the project root.": "Ordner, in dem die kompilierten Skripte gespeichert werden sollen (als relativer Pfad zum Projekt).",
  "Output format settings": "Ausgabeformat-Optionen",
  "The following options dictate what kind of script will be created.": "Die folgenden Optionen bestimmen, welche Art binäre Skriptdatei beim Kompilieren erstellt wird.",
  "Script file format": "Skriptdatei-Format",
  "The script format to compile to.": "Das binäre Skriptformat, in das kompiliert werden soll.",
  "Compiled script file (.scpt)": "Kompilierte Skript-Datei (.scpt)",
  "Compiled script bundle (.scptd)": "Kompiliertes Skript-Bundle (.scptd)",
  "Applet or Droplet (.app)": "Applet oder Droplet (.app)",
  "Do not strip the original file extension": "Dateierweiterung der Quelldatei beibehalten",
  "By default, the compiled file format extension will replace the original file extension (e.g. “file.js” becomes “file.scpt”). Check this if you want it to be appended instead (e.g. “file.js” becomes “file.js.scpt”).": "Standardmäßig wird die ursprüngliche Dateierweiterung der Quelldatei durch die passende Skript-Dateierweiterung ersetzt (›datei.js‹ z.B. wird ›datei.scpt‹). Diese Option sorgt dafür, dass sie stattdessen an die ursprüngliche angehängt wird (›datei.js‹ z.B. wird ›datei.js.scpt‹).",
  "Save the resulting script as execute-only": "Kompiliertes Skript als ›nur ausführen‹ speichern",
  "Compile the script for execution only: the source code will not be available for editing in the compiled file.": "Kompiliert das Skript für die reine Ausführung; der Quelltext ist im kompilierten Skript nicht zur Bearbeitung verfügbar.",
  "Applet / Droplet settings": "Applet- / Droplet-Optionen",
  "The following options are only relevant when creating a new bundled applet or droplet.": "Die folgenden Optionen sind nur bei der Erstellung von kompilierten Applets oder Droplets relevant.",
  "Stay-open applet": "Applet nach Skript-Ausführung nicht beenden",
  "Use startup screen": "Startbildschirm anzeigen",

  "Execute JXA script": "JXA-Skript ausführen",
  "Execute the current JavaScript for Automation (JXA) source code.": "Führt den aktuellen JavaScript for Automation (JXA)-Quelltext aus",
  "Run selection": "Auswahl ausführen",
  "Run the code of the primary selection in the editor. If this is unset, or if this is set and no code is selected, the whole source file will be run.": "Im Editor ausgewählten Quelltext ausführen (nur Primärauswahl). Ist kein Text ausgewählt oder diese Option abgeschaltet, wird der gesamte Quelltext der Datei ausgeführt",
  "Human readable output": "Lesefreundliche Ausgabe",
  "Printing results in human-readable form means strings do not have quotes around them, characters are not escaped, brackets for arrays and braces for objects are omitted, etc. Apple consider this as “generally more useful”, but it can introduce ambiguities. To see the results in an unambiguous form that could be recompiled into the same value, switch this off.": "Bei Ausgabe im lesefreundlichen Format werden die Begrenzer um Datentypen (also Anführungsstriche um Strings, eckige Klammern um Arrays und geschweifte Klammern um Objekte) ausgelassen, ebenso Escape-Zeichen in Strings u.a.m. Apple hält diese Darstellungsweise für »allgemein hilfreicher«, aber sie kann zweideutig sein. Für eine eindeutige, so wieder als Quelltext verwendbare Darstellung sollte diese Option ausgeschaltet sein."
}
